#include "debug_gpio.h"

/*-----------------------------------------------------------
** 功能描述: DEBUG端口初始化
** 入口参数: 无
** 出口参数: 无
-------------------------------------------------------------*/
void Debug_Gpio_Init(void)
{
    Pub_Gpio_Output_OUTPP(DEBUG_GPIOx, DEBUG_GPIOx_PIN);
}

/*-----------------------------------------------------------
** 功能描述: DEBUG端口置位
** 入口参数: 无
** 出口参数: 无
-------------------------------------------------------------*/
void Debug_Gpio_SetBit(void)
{
    GPIO_SetBits(DEBUG_GPIOx,DEBUG_GPIOx_PIN);
}

/*-----------------------------------------------------------
** 功能描述: DEBUG端口复位
** 入口参数: 无
** 出口参数: 无
-------------------------------------------------------------*/
void Debug_Gpio_ResetBit(void)
{
    GPIO_ResetBits(DEBUG_GPIOx,DEBUG_GPIOx_PIN);
}
